xml_example.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:u="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
    <s:Header>
        <a:Action s:mustUnderstand="1">Retrieve</a:Action>
        <a:MessageID>urn:uuid:7e0cca04-57bd-4481-864c-6ea8039d2ea0</a:MessageID>
        <a:ReplyTo>
            <a:Address>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:Address>
        </a:ReplyTo>
        <a:To s:mustUnderstand="1">https://{{et_subdomain}}.soap.marketingcloudapis.com/Service.asmx</a:To>
        <fueloauth xmlns="http://exacttarget.com">{{dne_etAccessToken}}</fueloauth>
    </s:Header>
    <s:Body xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
        <CreateRequest xmlns="http://exacttarget.com/wsdl/partnerAPI">
            <Options/>
            <ns1:Objects xmlns:ns1="http://exacttarget.com/wsdl/partnerAPI" xsi:type="ns1:FilterDefinition">
                <ns1:ModifiedDate xsi:nil="true"/>
                <ns1:ObjectID xsi:nil="true"/>
                <ns1:Name>Dimi_data_filter_3</ns1:Name>
                <ns1:CustomerKey>Dimi_data_filter_3</ns1:CustomerKey>
                <ns1:DataSource xsi:type="ns1:DataExtension">
                    <ns1:ModifiedDate xsi:nil="true"/>
                    <ns1:ObjectID>99e58289-1cdc-ec11-b83a-48df37e39266</ns1:ObjectID>
                </ns1:DataSource>
                <ns1:DataFilter xsi:type="par:ComplexFilterPart" xmlns:par="http://exacttarget.com/wsdl/partnerAPI">
                    <LeftOperand xsi:type="par:ComplexFilterPart">
                        <LeftOperand xsi:type="par:SimpleFilterPart">
                            <Property>Country</Property>
                            <SimpleOperator>equals</SimpleOperator>
                            <Value>UK</Value>
                        </LeftOperand>
                        <LogicalOperator>AND</LogicalOperator>
                        <RightOperand xsi:type="par:SimpleFilterPart">
                            <Property>Language</Property>
                            <SimpleOperator>equals</SimpleOperator>
                            <Value>EN</Value>
                        </RightOperand>
                    </LeftOperand>
                    <LogicalOperator>AND</LogicalOperator>
                    <RightOperand xsi:type="par:SimpleFilterPart">
                        <Property>email address</Property>
                        <SimpleOperator>contains</SimpleOperator>
                        <Value>@mc.sc</Value>
                    </RightOperand>
                </ns1:DataFilter>
            </ns1:Objects>
        </CreateRequest>
    </s:Body>
</s:Envelope>

<LeftOperand> 
    <LeftOperand> 
        <Property> Country </Property>,
        <SimpleOperator> is equal to </SimpleOperator>,
        <Value> UK </Value> 
    </LeftOperand>,
    <LogicalOperator> AND </LogicalOperator>,
    <RightOperand> 
        <Property> Language </Property>,
        <SimpleOperator> is equal to </SimpleOperator>,
        <Value> EN </Value> 
    </RightOperand> 
    </LeftOperand>
<LogicalOperator> AND </LogicalOperator>
<RightOperand> 
    <Property> Email Address </Property>,
    <SimpleOperator> contains </SimpleOperator>,
    <Value> @mc.sc </Value> 
</RightOperand>